def linear_spline(x: float, x_list: list[float], y_list: list[float]) -> float:
    """
    Вычисление значения линейного сплайна в заданной точке.

    Линейный сплайн - это кусочно-линейная интерполяция, которая строит прямые
    между соседними узлами интерполяции. Значение функции в точке x вычисляется
    как линейная комбинация значений в ближайших узлах.

    :param x: Точка, в которой вычисляется значение сплайна.
    :param x_list: Список координат узлов интерполяции (должен быть отсортирован по возрастанию).
    :param y_list: Список значений функции в узлах интерполяции.

    :return: 
        Значение линейного сплайна в точке x, если x находится в диапазоне [x_list[0], x_list[-1]].
    """
    n = len(x_list) - 1
    for i in range(n):
        if x_list[i] <= x <= x_list[i + 1]:
            return (
                y_list[i] + (y_list[i + 1] - y_list[i]) * 
                (x - x_list[i]) / (x_list[i + 1] - x_list[i])
            )
    raise ValueError(f"Точка {x} находится вне диапазона интерполяции")
